var siteCodeToName = {"0111": "莘庄", "0112": "外环路", "0113": "莲花路", "0114": "锦江乐园", "0115": "上海南站", "0116": "漕宝路", "0117": "上海体育馆", "0118": "徐家汇", "0119": "衡山路", "0120": "常熟路", "0121": "陕西南路", "0122": "黄陂南路", "0123": "人民广场", "0124": "新闸路", "0125": "汉中路", "0126": "上海火车站", "0127": "中山北路", "0128": "延长路", "0129": "上海马戏城", "0130": "汶水路", "0131": "彭浦新村", "0132": "共康路", "0133": "通河新村", "0134": "呼兰路", "0135": "共富新村", "0136": "宝安公路", "0137": "友谊西路", "0138": "富锦路", "0234": "徐泾东", "0235": "虹桥火车站", "0236": "虹桥2号航站楼", "0237": "淞虹路", "0238": "北新泾", "0239": "威宁路", "0240": "娄山关路", "0241": "中山公园", "0242": "江苏路", "0243": "静安寺", "0244": "南京西路", "0245": "人民广场", "0246": "南京东路", "0247": "陆家嘴", "0248": "东昌路", "0249": "世纪大道", "0250": "上海科技馆", "0251": "世纪公园", "0252": "龙阳路", "0253": "张江高科", "0254": "金科路", "0255": "广兰路", "0256": "唐镇", "0257": "创新中路", "0258": "华夏东路", "0259": "川沙", "0260": "凌空路", "0261": "远东大道", "0262": "海天三路", "0263": "浦东国际机场", "0311": "上海南站", "0312": "石龙路", "0313": "龙漕路", "0314": "漕溪路", "0315": "宜山路", "0316": "虹桥路", "0317": "延安西路", "0318": "中山公园", "0319": "金沙江路", "0320": "曹杨路", "0321": "镇坪路", "0322": "中潭路", "0323": "上海火车站", "0324": "宝山路", "0325": "东宝兴路", "0326": "虹口足球场", "0327": "赤峰路", "0328": "大柏树", "0329": "江湾镇", "0330": "殷高西路", "0331": "长江南路", "0332": "淞发路", "0333": "张华浜", "0334": "淞滨路", "0335": "水产路", "0336": "宝杨路", "0337": "友谊路", "0338": "铁力路", "0339": "江杨北路", "0401": "上海体育馆", "0402": "宜山路", "0403": "虹桥路", "0404": "延安西路", "0405": "中山公园", "0406": "金沙江路", "0407": "曹杨路", "0408": "镇坪路", "0409": "中潭路", "0410": "上海火车站", "0411": "宝山路", "0412": "海伦路", "0413": "临平路", "0414": "大连路", "0415": "杨树浦路", "0416": "浦东大道", "0417": "世纪大道", "0418": "浦电路", "0419": "蓝村路", "0420": "塘桥", "0421": "南浦大桥", "0422": "西藏南路", "0423": "鲁班路", "0424": "大木桥路", "0425": "东安路", "0426": "上海体育场", "0501": "莘庄", "0502": "春申路", "0503": "银都路", "0505": "颛桥", "0507": "北桥", "0508": "剑川路", "0509": "东川路", "0510": "金平路", "0511": "华宁路", "0512": "文井路", "0513": "闵行开发区", "0621": "东方体育中心", "0622": "灵岩南路", "0623": "上南路", "0624": "华夏西路", "0625": "高青路", "0626": "东明路", "0627": "高科西路", "0628": "临沂新村", "0629": "上海儿童医学中心", "0630": "蓝村路", "0631": "浦电路", "0632": "世纪大道", "0633": "源深体育中心", "0634": "民生路", "0635": "北洋泾路", "0636": "德平路", "0637": "云山路", "0638": "金桥路", "0639": "博兴路", "0640": "五莲路", "0641": "巨峰路", "0642": "东靖路", "0643": "五洲大道", "0644": "洲海路", "0645": "外高桥保税区南站", "0646": "航津路", "0647": "外高桥保税区北站", "0648": "港城路", "0721": "美兰湖", "0722": "罗南新村", "0723": "潘广路", "0724": "刘行", "0725": "顾村公园", "0726": "祁华路", "0727": "上海大学", "0728": "南陈路", "0729": "上大路", "0730": "场中路", "0731": "大场镇", "0732": "行知路", "0733": "大华三路", "0734": "新村路", "0735": "岚皋路", "0736": "镇坪路", "0737": "长寿路", "0738": "昌平路", "0739": "静安寺", "0740": "常熟路", "0741": "肇嘉浜路", "0742": "东安路", "0743": "龙华中路", "0744": "后滩", "0745": "长清路", "0746": "耀华路", "0747": "云台路", "0748": "高科西路", "0749": "杨高南路", "0750": "锦绣路", "0751": "芳华路", "0752": "龙阳路", "0753": "花木路", "0820": "沈杜公路", "0821": "联航路", "0822": "江月路", "0823": "浦江镇", "0824": "芦恒路", "0825": "凌兆新村", "0826": "东方体育中心", "0827": "杨思", "0828": "成山路", "0829": "耀华路", "0830": "中华艺术宫", "0831": "西藏南路", "0832": "陆家浜路", "0833": "老西门", "0834": "大世界", "0835": "人民广场", "0836": "曲阜路", "0837": "中兴路", "0838": "西藏北路", "0839": "虹口足球场", "0840": "曲阳路", "0841": "四平路", "0842": "鞍山新村", "0843": "江浦路", "0844": "黄兴路", "0845": "延吉中路", "0846": "黄兴公园", "0847": "翔殷路", "0848": "嫩江路", "0849": "市光路", "0918": "松江南站", "0919": "醉白池", "0920": "松江体育中心", "0921": "松江新城", "0922": "松江大学城", "0923": "洞泾", "0924": "佘山", "0925": "泗泾", "0926": "九亭", "0927": "中春路", "0928": "七宝", "0929": "星中路", "0930": "合川路", "0931": "漕河泾开发区", "0932": "桂林路", "0933": "宜山路", "0934": "徐家汇", "0935": "肇嘉浜路", "0936": "嘉善路", "0937": "打浦桥", "0938": "马当路", "0939": "陆家浜路", "0940": "小南门", "0941": "商城路", "0942": "世纪大道", "0943": "杨高中路", "1018": "航中路", "1019": "紫藤路", "1020": "龙柏新村", "1041": "虹桥火车站", "1042": "虹桥2号航站楼", "1043": "虹桥1号航站楼", "1044": "上海动物园", "1045": "龙溪路", "1046": "水城路", "1047": "伊犁路", "1048": "宋园路", "1049": "虹桥路", "1050": "交通大学", "1051": "上海图书馆", "1052": "陕西南路", "1053": "新天地", "1054": "老西门", "1055": "豫园", "1056": "南京东路", "1057": "天潼路", "1058": "四川北路", "1059": "海伦路", "1060": "邮电新村", "1061": "四平路", "1062": "同济大学", "1063": "国权路", "1064": "五角场", "1065": "江湾体育场", "1066": "三门路", "1067": "殷高东路", "1068": "新江湾城", "1114": "花桥", "1115": "光明路", "1116": "兆丰路", "1117": "安亭", "1118": "上海汽车城", "1119": "昌吉东路", "1120": "上海赛车场", "1131": "嘉定北", "1132": "嘉定西", "1133": "白银路", "1134": "嘉定新城", "1135": "马陆", "1137": "南翔", "1138": "桃浦新村", "1139": "武威路", "1140": "祁连山路", "1141": "李子园", "1142": "上海西站", "1143": "真如", "1144": "枫桥路", "1145": "曹杨路", "1146": "隆德路", "1147": "江苏路", "1148": "交通大学", "1149": "徐家汇", "1150": "上海游泳馆", "1151": "龙华", "1152": "云锦路", "1153": "龙耀路", "1154": "东方体育中心", "1155": "三林", "1156": "三林东", "1157": "浦三路", "1158": "严御路", "1159": "御桥", "1160": "罗山路", "1236": "曲阜路", "1237": "天潼路", "1238": "国际客运中心", "1239": "提篮桥", "1240": "大连路", "1241": "江浦公园", "1242": "宁国路", "1243": "隆昌路", "1244": "爱国路", "1245": "复兴岛", "1246": "东陆路", "1247": "巨峰路", "1248": "杨高北路", "1249": "金京路", "1250": "申江路", "1251": "金海路", "1321": "金运路", "1322": "金沙江西路", "1323": "丰庄", "1324": "祁连山南路", "1325": "真北路", "1326": "大渡河路", "1327": "金沙江路", "1328": "隆德路", "1329": "武宁路", "1330": "长寿路", "1621": "龙阳路", "1622": "华夏中路", "1623": "罗山路", "1624": "周浦东", "1625": "鹤沙航城", "1626": "航头东", "1627": "新场", "1628": "野生动物园", "1629": "惠南", "1630": "惠南东", "1631": "书院", "1632": "临港大道", "1633": "滴水湖", "1222": "顾戴路", "1223": "东兰路", "1225": "虹漕路", "1229": "龙华", "1227": "漕宝路", "1234": "南京西路", "1235": "汉中路", "1220": "七莘路", "1224": "虹梅路", "1221": "虹莘路", "1226": "桂林公园", "1228": "龙漕路", "1233": "陕西南路", "1232": "嘉善路", "1231": "大木桥路", "1230": "龙华中路"};
//$.ajaxSettings.async = false;
//$.getJSON('../jsonData/site_dict.json', function(result) {
//	siteCodeToName = result;
//});
//siteCodeToName['0111']

function getTime(time) {
	var ret = -1;
	if(time == 287) {
		ret = 72;
	} else {
		ret = time + 1;
	}
	if(ret == -1) {
		ret = 72;
	}
	return ret;
}

//补0，将一位数字扩充为两位
function zfill(num) {
	var t = (num + "").length,
		s = '';
	for(var i = 0; i < 2 - t; i++) {
		s += '0';
	}
	return s + num;
}

//将20150301转换为2015年03月01日
function dateConvert(date) {
	var ret = null;
	var year = date.slice(0, 4);
	var month = date.slice(4, 6);
	var day = date.slice(6, 8);
	ret = year + "年" + month + "月" + day + "日";
	return ret;
}

function setStationAndColor(options, color) {
	function getFeed(in_out, date, time_slice) {
		var url = "./jsonData/" + in_out + "_site/" + in_out + "_site_" + date + ".json";
		$.getJSON(url, function(result) {
			var res = new Object();
			$.each(result, function(site_code, people) {
				res[siteCodeToName[site_code]] = people[time_slice];
			});
			getStationPassenger(options['options3'], res);
			setLinePath(options['options2'], res);
		});
	}

	/*
	var in_out = document.getElementById('in_out').value;
	var date = document.getElementById('date').value;
	var timeBox = document.getElementById("clock");
	var dateBox = document.getElementById("datebox");
	timeBox.innerHTML = "06:00";
	if(in_out == 'in') {
		dateBox.innerHTML = dateConvert(date) + '进站流量';
	} else {
		dateBox.innerHTML = dateConvert(date) + '出站流量';
	}
	*/
	var in_out = 'in'
	var date = document.getElementById('date').value;
	var t = 72;
	getFeed(in_out, date, t);
	setInterval(function() {
		in_outInit = in_out;
		//in_out = document.getElementById('in_out').value;
		in_out = 'in'
		dateInit = date;
		date = document.getElementById('date').value;

		if(dateInit != date || in_outInit != in_out) {
			t = 72;
		} else {
			t = getTime(t);
		}
		var timeStr = null;
		timeStr = zfill(parseInt((t * 5) / 60));
		timeStr += ':';
		timeStr += zfill((t * 5) % 60);
		timeBox.innerHTML = timeStr;
		if(in_out == 'in') {
			dateBox.innerHTML = dateConvert(date) + '进站流量';
		} else {
			dateBox.innerHTML = dateConvert(date) + '出站流量';
		}
		getFeed(in_out, date, t);
	}, 50);
}